#### BuiltInFailures.RebarCouplerFailures Members

---

|  |
| --- |
| BuiltInFailures RebarCouplerFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures RebarCouplerFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CantKeepConstraintsToBars | The constraints between the coupler and the two connected bars are no longer satisfied. Post error to delete the coupler. |
| Public property Static member | CouplerRequiredRemoveFromGroup | The coupler is invalid in group. |
| Public property Static member | CouplerTypeInvalid | This coupler type does not fit on the selected bar(s). Post error to delete the coupler. |
| Public property Static member | DisconnectElements | Disconnect the coupler from the connected bar. |
| Public property Static member | DistanceBetweenBarsError | This is used to post error. The distance between the connected ends of the bars exceeds 10 bar diameters. |
| Public property Static member | DistanceBetweenBarsWarning | This is used to post warning. The distance between the connected ends of the bars exceeds 10 bar diameters. |
| Public property Static member | EngagementBiggerThanLengthError | This is used to post error. The sum of bar engagements is greater than the total coupler length. |
| Public property Static member | EngagementBiggerThanLengthWarning | This is used to post warning. The sum of bar engagements is greater than the total coupler length. |
| Public property Static member | LengthParameterError | This is used to post error. The "Total Length" parameter must be set to a strictly positive value. |
| Public property Static member | LengthParameterWarning | This is used to post warning. The "Total Length" parameter must be set to a strictly positive value. |
| Public property Static member | MainEngagementParameterError | This is used to post error. "Bar Engagement 1" has an incorrect value. |
| Public property Static member | MainEngagementParameterWarning | This is used to post warning. "Bar Engagement 1" has an incorrect value. |
| Public property Static member | NewCouplerTypeCreated | A new coupler type was automatically created to fit the bar diameters. |
| Public property Static member | NoBarSizeError | This is used to post error. At least Bar Size 1 or Bar Size 2 should have another value than "None". |
| Public property Static member | NoBarSizeWarning | This is used to post warning. At least Bar Size 1 or Bar Size 2 should have a value other than "None". |
| Public property Static member | NoTypeParamsDefinedWarning | The parameters of the default type have no values. |
| Public property Static member | SecondaryEngagementParameterError | This is used to post error. "Bar Engagement 2" has an incorrect value. |
| Public property Static member | SecondaryEngagementParameterWarning | This is used to post warning. "Bar Engagement 2" has an incorrect value. |
| Public property Static member | WidthParameterError | This is used to post error.The "External Diameter" parameter must be set to a strictly positive value. |
| Public property Static member | WidthParameterWarning | This is used to post warning. The "External Diameter" parameter must be set to a strictly positive value. |

# See Also

BuiltInFailures RebarCouplerFailures Class

Autodesk.Revit.DB Namespace